---
kind: enumMember
id: F:Autodesk.Revit.DB.PointOnCurveMeasureFrom.Beginning
enum: Autodesk.Revit.DB.PointOnCurveMeasureFrom
source: html/144dc931-4f06-cb80-2b6b-8479ab21920a.htm
---
# Autodesk.Revit.DB.PointOnCurveMeasureFrom.Beginning

Beginning of the host curve.